artillery-tests/house-load-test.yml
config:
  target: https://scc-backend-erikg.azurewebsites.net/rest
  phases:
    - duration: 15
      arrivalRate: 1 # new virtual users per second
      rampTo: 5
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      name: Main test
  plugins:
    metrics-by-endpoint: 
      useOnlyRequestNames: true
  processor: "./processor.cjs"
  payload:
    path: "mock-data/users.csv"
    fields:
      - "username"
      - "password"
    skipHeader: true
scenarios:
  - name: "House Flow" # Each virtual users runs this scenario
    flow:
      - post: 
          url: "/user"
          name: "POST /user"
          json: 
            name: "{{ username }}"
            pwd: "{{ password }}"
          capture:
            - header: "location"
              as: "userID"
          afterResponse: "setUserID"
      - post: 
          url: "/user/auth"
          name: "POST /user/auth"
          json: 
            username: "{{ username }}"
            password: "{{ password }}"
      - post:
          url: "/house"
          name: "POST /house"
          json:
            name: "testHouse"
            description: "testDescription"
          capture:
            - header: "location"
              as: "houseID"
          afterResponse: "setHouseID"
      - loop:
          - get:
              url: "/house/{{ houseID }}"
              name: "GET /house/:houseID"
        count: 30
      - delete:
          url: "/house/{{ houseID }}"
          name: "DELETE /house/:houseID"
      - delete:
          url: "/user/{{ userID }}"
          name: "DELETE /user/:userID"