artillery-tests/rental-load-test.yml
config:
  target: https://scc-backend-erikg.azurewebsites.net/rest
  phases:
    - duration: 10
      arrivalRate: 1 # virtual users per second
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      name: Main test
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  http:
    defaults:
      headers:
        Content-Type: "application/json"
  processor: "./processor.js"
scenarios:
  - name: "Rental Flow"
    flow:
      - post:
          url: "/house"
          name: "POST /house"
          json:
            name: "testHouse"
            ownerID: "testOwner"
            description: "testDescription"
          capture:
            - header: "location"
              as: "houseID"
          afterResponse: "setHouseID"
      - post:
          url: "/house/{{ houseID }}/rental"
          name: "POST /house/:houseID/rental"
          json:
            houseID: "{{ houseID }}"
            tenantID: "unknownTenantID"
            startDate: "2024-01-01"
            endDate: "2024-03-01"
            price: 1200.50
          capture:
            - header: "location"
              as: "rentalID"
          afterResponse: "setRentalID"
      - get:
          url: "/house/{{ houseID }}/rental/{{ rentalID }}"
          name: "GET /house/:houseID/rental/:rentalID"
      - delete:
          url: "/house/{{ houseID }}/rental/{{ rentalID }}"
          name: "DELETE /house/:houseID/rental/:rentalID"
      - delete:
          url: "/house/{{ houseID }}"
          name: "DELETE /house/:houseID"