artillery-tests/test-load-houses.yml
config:
  target: https://outsideeurope.azurewebsites.net/rest
  phases:
    - duration: 15
      arrivalRate: 1 # new virtual users per second
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 10
      name: Main test
  plugins:
    metrics-by-endpoint: 
      useOnlyRequestNames: true
  processor: "./processor.cjs"
  payload:
    path: "mock-data/users.csv"
    fields:
      - "username"
      - "password"
    skipHeader: true
scenarios:
  - name: "House Flow" # Each virtual users runs this scenario
    flow:
      - post: ######### user requests #########
          url: "/user"
          name: "POST /user"
          json: 
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - header: "location"
              as: "userID"
          afterResponse: "setUserID"
      - post: 
          url: "/user/auth"
          name: "POST /user/auth"
          json: 
            username: "{{ username }}"
            password: "{{ password }}"
      - post:
          url: "/house"
          name: "POST /house"
          json:
            name: "{{ name }}"
            description: "{{ description }}"
            address:  
              street: "{{ street }}"
              city: "{{ city }}"
              country: "{{ country }}"
            availablePeriods:
              - startDate: "{{ startDate }}"
                endDate: "{{ endDate }}"
                normalPricePerDay: "{{ normalPricePerDay }}"
                promotionPricePerDay: "{{ promotionPricePerDay }}"
          capture:
            - header: "location"
              as: "houseID"
          afterResponse: "setHouseID"
      - loop:
          - get:
              url: "/house/{{ houseID }}"
              name: "GET /house/:houseID"
        count: 30
      - delete:
          url: "/house/{{ houseID }}"
          name: "DELETE /house/:houseID"
      - delete:
          url: "/user/{{ userID }}"
          name: "DELETE /user/:userID"